# =============================================================================
# Homebrew Bundle Configuration
# =============================================================================
# Generate: brew bundle dump --force --file=brew/Brewfile
# Install: brew bundle install --file=brew/Brewfile
# Check:   brew bundle check --file=brew/Brewfile

# =============================================================================
# Taps (Third-party repositories)
# =============================================================================
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jesseduffield/lazydocker"

# =============================================================================
# System & Shell Essentials
# =============================================================================
brew "stow"                    # Symlink farm manager for dotfiles
brew "antidote"                # Fast zsh plugin manager
brew "zsh-autocomplete"        # Real-time zsh completions
brew "zsh-autosuggestions"     # Fish-like autosuggestions for zsh

# =============================================================================
# Terminal & Multiplexers
# =============================================================================
brew "tmux"                    # Terminal multiplexer
brew "zellij"                  # Modern terminal workspace

# =============================================================================
# Navigation & File Management
# =============================================================================
brew "fzf"                     # Fuzzy finder
brew "zoxide"                  # Smart cd replacement
brew "autojump"                # Quick directory jumping
brew "fd"                      # Fast find alternative
brew "ripgrep"                 # Fast grep alternative
brew "bat"                     # Cat with syntax highlighting
brew "eza"                     # Modern ls replacement
brew "yazi"                    # Terminal file manager
brew "jless"                   # JSON viewer

# =============================================================================
# Development Tools
# =============================================================================
brew "neovim"                  # Modern vim
brew "git"                     # Version control (if not already installed)
brew "git-delta"               # Better git diffs with syntax highlighting
brew "diff-so-fancy"           # Alternative git diff tool
brew "jq"                      # JSON processor
brew "btop"                    # System monitor
brew "tlrc"                    # TL;DR pages client

# =============================================================================
# Container & Cloud Tools
# =============================================================================
brew "docker"                 # Container platform
brew "docker-buildx"          # Docker build extensions
brew "docker-compose"         # Multi-container Docker applications
brew "kubernetes-cli"         # Kubernetes command-line tool
brew "lazydocker"             # Docker TUI
brew "lazygit"                # Git TUI

# =============================================================================
# Media & File Processing
# =============================================================================
brew "ffmpeg"                 # Media processing
brew "ffmpegthumbnailer"      # Video thumbnail generator
brew "yt-dlp"                 # YouTube downloader
brew "unar"                   # Archive extractor
brew "poppler"                # PDF utilities

# =============================================================================
# Programming Languages & Package Managers
# =============================================================================
brew "python@3.11"           # Python 3.11
brew "pipx"                   # Python package installer
brew "virtualenvwrapper"     # Python virtual environment wrapper
brew "ant"                    # Java build tool

# =============================================================================
# Database & Testing
# =============================================================================
brew "ccm"                    # Cassandra Cluster Manager

# =============================================================================
# Essential Fonts (Curated Selection)
# =============================================================================
# Only keeping the most popular and useful programming fonts
cask "font-jetbrains-mono-nerd-font"    # JetBrains Mono (excellent for coding)
cask "font-fira-code-nerd-font"         # Fira Code (popular with ligatures)
cask "font-hack-nerd-font"              # Hack (clean, readable)
cask "font-meslo-lg-nerd-font"          # Meslo LG (good for terminals)
cask "font-sauce-code-pro-nerd-font"    # Source Code Pro (Adobe's font)
cask "font-ubuntu-mono-nerd-font"       # Ubuntu Mono (clean, modern)
cask "font-inconsolata-nerd-font"       # Inconsolata (classic programming font)
cask "font-monaspace-nerd-font"         # Monaspace (GitHub's new font family)

# =============================================================================
# Development Applications
# =============================================================================
cask "alfred"                 # Productivity app
cask "iterm2"                 # Terminal emulator
cask "wezterm"               # GPU-accelerated terminal
cask "jetbrains-toolbox"     # JetBrains IDE manager
cask "sublime-text"          # Text editor
cask "sublime-merge"         # Git client
cask "zed"                   # Modern code editor
cask "tower"                 # Git client
cask "kaleidoscope"          # File comparison tool
cask "postman"               # API testing

# =============================================================================
# Productivity & Utilities
# =============================================================================
cask "obsidian"              # Note-taking
cask "qfinder-pro"           # File search utility

# =============================================================================
# Media & Creative Tools
# =============================================================================
cask "adobe-creative-cloud"  # Adobe Creative Suite
cask "vlc"                   # Media player
cask "topaz-video-ai"        # Video enhancement
cask "insta360-studio"       # 360 camera software
cask "elgato-control-center" # Elgato device control
cask "rode-central"          # Rode microphone control

# =============================================================================
# Communication
# =============================================================================
cask "discord"               # Gaming/community chat
cask "telegram"              # Messaging
cask "whatsapp"              # Messaging
cask "messenger"             # Facebook Messenger
cask "slack"                 # Team communication

# =============================================================================
# Mac App Store Applications
# =============================================================================
# Uncomment and add your Mac App Store apps here
# mas "Xcode", id: 497799835
# mas "TestFlight", id: 899247664
# mas "Amphetamine", id: 937984704
# mas "The Unarchiver", id: 425424353